[
  {
    "name": "Tom Duance",
    "bioDescription": "CFO",
    "currentCompany": "Wave",
    "education": "Institute of Chartered Accountants in England and Wales",
    "location": "Newcastle Upon Tyne, England, United Kingdom",
    "industry": "Accounting",
    "numConnections": "500+",
    "experience": [
      {
        "role": "Chief Financial Officer",
        "company": "Wave",
        "partTime": false,
        "date": "May 2022 - Present",
        "tenure": "2 yrs 2 mos",
        "description": "Responsibility for Finance, HR and Legal at a private equity backed retailer selling via a mixture of D2C and B2B channels in UK, USA and Europe. Refinancing debt facilities, leading Board meetings, strategy workstreams, implementing new ERP system and improving commercial reporting and decision-making.",
        "skills": ""
      },
      {
        "role": "Head of Finance",
        "company": "Boohoo Group PLC",
        "partTime": false,
        "date": "May 2021 - May 2022",
        "tenure": "1 yr 1 mo",
        "description": "Finance lead for Debenhams following its acquisition, helping shape the strategy to become the leading UK online department store across marketplace, beauty and own brand categories. Commercially focused with regular Board-level interaction whilst also managing other areas of finance such as controls, cash flow and accounting.",
        "skills": ""
      },
      {
        "role": "Head Of Commercial Finance",
        "company": "Boohoo Group PLC",
        "partTime": false,
        "date": "Sep 2018 - May 2021",
        "tenure": "2 yrs 9 mos",
        "description": "Leading all aspects of commercial finance for the Boohoo Womenswear brand, whilst also overseeing commercial finance teams for other acquired Group brands, including Nasty Gal, Karen Millen, Coast and Miss Pap. Leading the Group supply chain finance team on an interim basis, including warehousing, customer services, carriage and returns. Line management of up to seven direct reports.",
        "skills": ""
      },
      {
        "role": "Senior Trading Finance Manager",
        "company": "",
        "partTime": false,
        "date": "Aug 2016 - Aug 2018",
        "tenure": "2 yrs 1 mo",
        "description": "Working closely with CEO, CFO and Directors across Marketing, Merchandising, Ecommerce and Operations to understand trading performance for the Group and ensure all business functions were aligned to sales and profitability targets. Implementing daily reporting, analysing gross margins, improving marketing ROI, operational efficiency and modelling strategic business initiatives.",
        "skills": ""
      },
      {
        "role": "Financial Planning Manager",
        "company": "",
        "partTime": false,
        "date": "Jun 2014 - Jul 2016",
        "tenure": "2 yrs 2 mos",
        "description": "Establishing a central Group FP&A team, embedding annual budget and quarterly reforecast cycles to align with AIM reporting deadlines, implementing weekly trading reporting, business partnering with all departments and challenging stakeholders to overachieve against budgeted KPls.",
        "skills": ""
      },
      {
        "role": "Financial Planning Analyst",
        "company": "",
        "partTime": false,
        "date": "Nov 2013 - May 2014",
        "tenure": "6 mos",
        "description": "Implementing new financial models encompassing all business areas including financial, non-financial and operational forecasts. One of the first recruits into commercial finance, joining pre-IPO, with Board-level exposure from the outset.",
        "skills": ""
      },
      {
        "role": "Transaction Services Assistant Manager",
        "company": "Grant Thornton UK LLP",
        "partTime": false,
        "date": "May 2011 - Nov 2013",
        "tenure": "2 yrs 8 mos",
        "description": "Providing financial due diligence services (buy side, sell side and public company) to a wide range of businesses on acquisitions, mergers, disposals, refinancing and investments. Including UK PLCs, fast-growing privately-owned businesses, private equity houses and other financial institutions.",
        "skills": ""
      },
      {
        "role": "Audit and Accounts Senior",
        "company": "ERC Business Advisors",
        "partTime": false,
        "date": "Jan 2009 - May 2011",
        "tenure": "2 yrs 4 mos",
        "description": "Leading teams on audit and accounts preparation assignments, from planning to completion. Management of diverse client portfolio, from sole trader to medium sized companies.",
        "skills": ""
      },
      {
        "role": "Audit Assistant",
        "company": "KPMG",
        "partTime": false,
        "date": "Sep 2007 - Nov 2008",
        "tenure": "1 yr 4 mos",
        "description": "Team member on large company audit assignments and leading smaller audit assignments, including substantive audit work, controls planning/testing and statutory accounts review.",
        "skills": ""
      }
    ],
    "education_details": [
      {
        "name": "ICAEW",
        "subject": "ACA",
        "date": "2007 — 2010",
        "subjectDetails": ""
      },
      {
        "name": "The University of Manchester",
        "subject": "BSc (Hons) - Mathematics",
        "date": "2004 — 2007",
        "subjectDetails": ""
      }
    ],
    "extractedLinkedInURLs": ["www.linkedin.com/in/tomduance"]
  }
]
